witalis3/UA3REO-DDC-Transceiver/STM32/Src/audio_processor.c
	if(TRX.Dual_RX_Type != VFO_SEPARATE)
	{
		switch (TRX_getMode(secondary_vfo)) //второй приёмник
		{
		case TRX_MODE_LSB:
		case TRX_MODE_CW_L:
			doRX_HPF(AUDIO_RX2);
		case TRX_MODE_DIGI_L:
			doRX_HILBERT(AUDIO_RX2);
			doRX_LPF(AUDIO_RX2);
			arm_sub_f32((float32_t *)&FPGA_Audio_Buffer_RX2_I_tmp[0], (float32_t *)&FPGA_Audio_Buffer_RX2_Q_tmp[0], (float32_t *)&FPGA_Audio_Buffer_RX2_I_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE); // difference of I and Q - LSB
			doRX_NOTCH(AUDIO_RX2);
			doRX_DNR(AUDIO_RX2);
			doRX_AGC(AUDIO_RX2);
			break;
		case TRX_MODE_USB:
		case TRX_MODE_CW_U:
			doRX_HPF(AUDIO_RX2);
		case TRX_MODE_DIGI_U:
			doRX_HILBERT(AUDIO_RX2);
			doRX_LPF(AUDIO_RX2);
			arm_add_f32((float32_t *)&FPGA_Audio_Buffer_RX2_I_tmp[0], (float32_t *)&FPGA_Audio_Buffer_RX2_Q_tmp[0], (float32_t *)&FPGA_Audio_Buffer_RX2_I_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE); // sum of I and Q - USB
			doRX_NOTCH(AUDIO_RX2);
			doRX_DNR(AUDIO_RX2);
			doRX_AGC(AUDIO_RX2);
			break;
		case TRX_MODE_AM:
			doRX_LPF(AUDIO_RX2);
			arm_mult_f32((float32_t *)&FPGA_Audio_Buffer_RX2_I_tmp[0], (float32_t *)&FPGA_Audio_Buffer_RX2_I_tmp[0], (float32_t *)&FPGA_Audio_Buffer_RX2_I_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
			arm_mult_f32((float32_t *)&FPGA_Audio_Buffer_RX2_Q_tmp[0], (float32_t *)&FPGA_Audio_Buffer_RX2_Q_tmp[0], (float32_t *)&FPGA_Audio_Buffer_RX2_Q_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
			arm_add_f32((float32_t *)&FPGA_Audio_Buffer_RX2_I_tmp[0], (float32_t *)&FPGA_Audio_Buffer_RX2_Q_tmp[0], (float32_t *)&FPGA_Audio_Buffer_RX2_I_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
			for (uint_fast16_t i = 0; i < FPGA_AUDIO_BUFFER_HALF_SIZE; i++)
				arm_sqrt_f32(FPGA_Audio_Buffer_RX2_I_tmp[i], &FPGA_Audio_Buffer_RX2_I_tmp[i]);
			doRX_NOTCH(AUDIO_RX2);
			doRX_DNR(AUDIO_RX2);
			doRX_AGC(AUDIO_RX2);
			break;
		case TRX_MODE_NFM:
		case TRX_MODE_WFM:
			doRX_LPF(AUDIO_RX2);
			DemodulateFM(AUDIO_RX2);
			doRX_DNR(AUDIO_RX2);
			doRX_AGC(AUDIO_RX2);
			break;
		case TRX_MODE_IQ:
		default:
			break;
		}
	}

	//Prepare data to DMA
	int32_t* Processor_AudioBuffer_current;
	if (Processor_AudioBuffer_ReadyBuffer == 0)
		Processor_AudioBuffer_current = &Processor_AudioBuffer_B[0];
	else
		Processor_AudioBuffer_current = &Processor_AudioBuffer_A[0];
	for (uint_fast16_t i = 0; i < FPGA_AUDIO_BUFFER_HALF_SIZE; i++)
	{
		if(TRX.Dual_RX_Type == VFO_SEPARATE)
		{
			arm_float_to_q31(&FPGA_Audio_Buffer_RX1_I_tmp[i], &Processor_AudioBuffer_current[i * 2], 1); //left channel
			arm_float_to_q31(&FPGA_Audio_Buffer_RX1_Q_tmp[i], &Processor_AudioBuffer_current[i * 2 + 1], 1); //right channel
		}
		else if(TRX.Dual_RX_Type == VFO_A_AND_B)
		{
			arm_float_to_q31(&FPGA_Audio_Buffer_RX1_I_tmp[i], &Processor_AudioBuffer_current[i * 2], 1); //left channel
			arm_float_to_q31(&FPGA_Audio_Buffer_RX2_I_tmp[i], &Processor_AudioBuffer_current[i * 2 + 1], 1); //right channel
		}
		else if(TRX.Dual_RX_Type == VFO_A_PLUS_B)
		{
			arm_add_f32((float32_t *)&FPGA_Audio_Buffer_RX1_I_tmp[0], (float32_t *)&FPGA_Audio_Buffer_RX2_I_tmp[0], (float32_t *)&FPGA_Audio_Buffer_RX1_I_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
			arm_scale_f32(FPGA_Audio_Buffer_RX1_I_tmp, 0.5f, FPGA_Audio_Buffer_RX1_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
			arm_float_to_q31(&FPGA_Audio_Buffer_RX1_I_tmp[i], &Processor_AudioBuffer_current[i * 2], 1); //left channel
			arm_float_to_q31(&FPGA_Audio_Buffer_RX1_I_tmp[i], &Processor_AudioBuffer_current[i * 2 + 1], 1); //right channel
		}
	}
	if (Processor_AudioBuffer_ReadyBuffer == 0)
		Processor_AudioBuffer_ReadyBuffer = 1;
	else
		Processor_AudioBuffer_ReadyBuffer = 0;

	//Send to USB Audio
	if (USB_AUDIO_need_rx_buffer && TRX_Inited)
	{
		uint8_t* USB_AUDIO_rx_buffer_current;
			
		if (!USB_AUDIO_current_rx_buffer)
			USB_AUDIO_rx_buffer_current = &USB_AUDIO_rx_buffer_a[0];
		else
			USB_AUDIO_rx_buffer_current = &USB_AUDIO_rx_buffer_b[0];
			
		//drop LSB 32b->24b
		for (uint_fast16_t i = 0; i < (USB_AUDIO_RX_BUFFER_SIZE / BYTES_IN_SAMPLE_AUDIO_OUT_PACKET); i++)
		{
			USB_AUDIO_rx_buffer_current[i*BYTES_IN_SAMPLE_AUDIO_OUT_PACKET+0] = (Processor_AudioBuffer_current[i] >> 8) & 0xFF;
			USB_AUDIO_rx_buffer_current[i*BYTES_IN_SAMPLE_AUDIO_OUT_PACKET+1] = (Processor_AudioBuffer_current[i] >> 16) & 0xFF;
			USB_AUDIO_rx_buffer_current[i*BYTES_IN_SAMPLE_AUDIO_OUT_PACKET+2] = (Processor_AudioBuffer_current[i] >> 24) & 0xFF;
		}
		USB_AUDIO_need_rx_buffer = false;
	}
	//

	//OUT Volume
	float32_t volume_gain = volume2rate((float32_t)TRX.Volume / 1023.0f);
	for (uint_fast16_t i = 0; i < FPGA_AUDIO_BUFFER_SIZE; i++)
	{
		Processor_AudioBuffer_current[i] = Processor_AudioBuffer_current[i] * volume_gain;
		Processor_AudioBuffer_current[i] = convertToSPIBigEndian(Processor_AudioBuffer_current[i]); //for 32bit audio
	}

	//Send to Codec DMA
	if (TRX_Inited)
	{
		if (WM8731_DMA_state) //complete
		{
			HAL_DMA_Start_IT(&hdma_memtomem_dma2_stream0, (uint32_t)&Processor_AudioBuffer_current[0], (uint32_t)&CODEC_Audio_Buffer_RX[FPGA_AUDIO_BUFFER_SIZE], FPGA_AUDIO_BUFFER_SIZE);
			AUDIOPROC_TXA_samples++;
		}
		else //half
		{
			HAL_DMA_Start_IT(&hdma_memtomem_dma2_stream1, (uint32_t)&Processor_AudioBuffer_current[0], (uint32_t)&CODEC_Audio_Buffer_RX[0], FPGA_AUDIO_BUFFER_SIZE);
			AUDIOPROC_TXB_samples++;
		}
	}

	Processor_NeedRXBuffer = false;
}

void processTxAudio(void)
{
	if (!Processor_NeedTXBuffer)
		return;
	VFO *current_vfo = CurrentVFO();
	AUDIOPROC_samples++;
	Processor_selected_RFpower_amplitude = ((log10f_fast((float32_t)TRX.RF_Power / 10) + 1) / 2.0f) * TRX_MAX_TX_Amplitude;
	uint_fast8_t mode = TRX_getMode(current_vfo);
	if ((TRX_Tune && !TRX.TWO_SIGNAL_TUNE) || mode == TRX_MODE_CW_L || mode == TRX_MODE_CW_U)
		Processor_selected_RFpower_amplitude = Processor_selected_RFpower_amplitude * 0.7f; // поправка на нулевые биения

	if (TRX.InputType_USB) //USB AUDIO
	{
		uint_fast16_t buffer_index = USB_AUDIO_GetTXBufferIndex_FS() /BYTES_IN_SAMPLE_AUDIO_OUT_PACKET; //buffer 8bit, data 24 bit
		if ((buffer_index % BYTES_IN_SAMPLE_AUDIO_OUT_PACKET) == 1)
			buffer_index-=(buffer_index % BYTES_IN_SAMPLE_AUDIO_OUT_PACKET);
		readHalfFromCircleUSBBuffer24Bit(&USB_AUDIO_tx_buffer[0], &Processor_AudioBuffer_A[0], buffer_index, (USB_AUDIO_TX_BUFFER_SIZE / BYTES_IN_SAMPLE_AUDIO_OUT_PACKET));
	}
	else //AUDIO CODEC AUDIO
	{
		uint_fast16_t dma_index = CODEC_AUDIO_BUFFER_SIZE - __HAL_DMA_GET_COUNTER(hi2s3.hdmarx);
		if ((dma_index % 2) == 1) dma_index--;
		readHalfFromCircleBuffer32((uint32_t *)&CODEC_Audio_Buffer_TX[0], (uint32_t *)&Processor_AudioBuffer_A[0], dma_index, CODEC_AUDIO_BUFFER_SIZE);
	}

	//One-signal zero-tune generator
	if (TRX_Tune && !TRX.TWO_SIGNAL_TUNE)
	{
		for (uint_fast16_t i = 0; i < FPGA_AUDIO_BUFFER_HALF_SIZE; i++)
		{
			FPGA_Audio_Buffer_TX_I_tmp[i] = (Processor_selected_RFpower_amplitude / 100.0f * TUNE_POWER) * 0.7f;
			FPGA_Audio_Buffer_TX_Q_tmp[i] = (Processor_selected_RFpower_amplitude / 100.0f * TUNE_POWER) * 0.7f;
		}
	}

	//Two-signal tune generator
	if (TRX_Tune && TRX.TWO_SIGNAL_TUNE)
	{
		for (uint_fast16_t i = 0; i < FPGA_AUDIO_BUFFER_HALF_SIZE; i++)
		{
			float32_t point = generateSin((Processor_selected_RFpower_amplitude / 100.0f * TUNE_POWER) / 2.0f, two_signal_gen_position, TRX_SAMPLERATE, 1000);
			point += generateSin((Processor_selected_RFpower_amplitude / 100.0f * TUNE_POWER) / 2.0f, two_signal_gen_position, TRX_SAMPLERATE, 2000);
			two_signal_gen_position++;
			if (two_signal_gen_position > TRX_SAMPLERATE)
				two_signal_gen_position = 0;
			FPGA_Audio_Buffer_TX_I_tmp[i] = point;
			FPGA_Audio_Buffer_TX_Q_tmp[i] = point;
		}
		//hilbert fir
		// + 45 deg to Q data
		arm_fir_f32(&FIR_TX_Hilbert_Q, (float32_t *)&FPGA_Audio_Buffer_TX_I_tmp[0], (float32_t *)&FPGA_Audio_Buffer_TX_I_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
		// - 45 deg to I data
		arm_fir_f32(&FIR_TX_Hilbert_I, (float32_t *)&FPGA_Audio_Buffer_TX_Q_tmp[0], (float32_t *)&FPGA_Audio_Buffer_TX_Q_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
	}

	//Copy and convert buffer
	if (!TRX_Tune)
	{
		for (uint_fast16_t i = 0; i < FPGA_AUDIO_BUFFER_HALF_SIZE; i++)
		{
			FPGA_Audio_Buffer_TX_I_tmp[i] = Processor_AudioBuffer_A[i * 2];
			FPGA_Audio_Buffer_TX_Q_tmp[i] = Processor_AudioBuffer_A[i * 2 + 1];
		}
	}

	//Process DC corrector filter
	if (!TRX_Tune)
	{
		dc_filter(FPGA_Audio_Buffer_TX_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE, DC_FILTER_TX_I);
		dc_filter(FPGA_Audio_Buffer_TX_Q_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE, DC_FILTER_TX_Q);
	}

