witalis3/UA3REO-DDC-Transceiver/STM32/Src/audio_processor.c
static void doCW_Decode(AUDIO_PROC_RX_NUM rx_id)
{
	//CW Decoder
	if(rx_id==AUDIO_RX1)
	{
		if (TRX.CWDecoder && (TRX_getMode(CurrentVFO()) == TRX_MODE_CW_L || TRX_getMode(CurrentVFO()) == TRX_MODE_CW_U))
			for (block = 0; block < (FPGA_AUDIO_BUFFER_HALF_SIZE / CWDECODER_SAMPLES); block++)
				CWDecoder_Process((float32_t *)&FPGA_Audio_Buffer_RX1_I_tmp[0] + (block * CWDECODER_SAMPLES));
	}
	else if(rx_id==AUDIO_RX2)
	{
		if (TRX.CWDecoder && (TRX_getMode(CurrentVFO()) == TRX_MODE_CW_L || TRX_getMode(CurrentVFO()) == TRX_MODE_CW_U))
			for (block = 0; block < (FPGA_AUDIO_BUFFER_HALF_SIZE / CWDECODER_SAMPLES); block++)
				CWDecoder_Process((float32_t *)&FPGA_Audio_Buffer_RX2_I_tmp[0] + (block * CWDECODER_SAMPLES));
	}
}

static void doRX_HILBERT(AUDIO_PROC_RX_NUM rx_id)
{
	//Hilbert fir
	if(rx_id==AUDIO_RX1)
	{
		arm_fir_f32(&FIR_RX1_Hilbert_I, (float32_t *)&FPGA_Audio_Buffer_RX1_I_tmp[0], (float32_t *)&FPGA_Audio_Buffer_RX1_I_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
		arm_fir_f32(&FIR_RX1_Hilbert_Q, (float32_t *)&FPGA_Audio_Buffer_RX1_Q_tmp[0], (float32_t *)&FPGA_Audio_Buffer_RX1_Q_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
	}
	else if(rx_id==AUDIO_RX2)
	{
		arm_fir_f32(&FIR_RX2_Hilbert_I, (float32_t *)&FPGA_Audio_Buffer_RX2_I_tmp[0], (float32_t *)&FPGA_Audio_Buffer_RX2_I_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
		arm_fir_f32(&FIR_RX2_Hilbert_Q, (float32_t *)&FPGA_Audio_Buffer_RX2_Q_tmp[0], (float32_t *)&FPGA_Audio_Buffer_RX2_Q_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
	}
}

static void doRX_LPF(AUDIO_PROC_RX_NUM rx_id)
{
	//IIR LPF
	if(rx_id==AUDIO_RX1)
	{
		if (CurrentVFO()->LPF_Filter_Width > 0)
		{
			arm_iir_lattice_f32(&IIR_RX1_LPF_I, (float32_t *)&FPGA_Audio_Buffer_RX1_I_tmp[0], (float32_t *)&FPGA_Audio_Buffer_RX1_I_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
			arm_iir_lattice_f32(&IIR_RX1_LPF_Q, (float32_t *)&FPGA_Audio_Buffer_RX1_Q_tmp[0], (float32_t *)&FPGA_Audio_Buffer_RX1_Q_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
		}
	}
	else if(rx_id==AUDIO_RX2)
	{
		if (SecondaryVFO()->LPF_Filter_Width > 0)
		{
			arm_iir_lattice_f32(&IIR_RX2_LPF_I, (float32_t *)&FPGA_Audio_Buffer_RX2_I_tmp[0], (float32_t *)&FPGA_Audio_Buffer_RX2_I_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
			arm_iir_lattice_f32(&IIR_RX2_LPF_Q, (float32_t *)&FPGA_Audio_Buffer_RX2_Q_tmp[0], (float32_t *)&FPGA_Audio_Buffer_RX2_Q_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
		}
	}
}

static void doRX_HPF(AUDIO_PROC_RX_NUM rx_id)
{
	//IIR HPF
	if(rx_id==AUDIO_RX1)
	{
		if (CurrentVFO()->HPF_Filter_Width > 0)
		{
			arm_iir_lattice_f32(&IIR_RX1_HPF_I, (float32_t *)&FPGA_Audio_Buffer_RX1_I_tmp[0], (float32_t *)&FPGA_Audio_Buffer_RX1_I_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
			arm_iir_lattice_f32(&IIR_RX1_HPF_Q, (float32_t *)&FPGA_Audio_Buffer_RX1_Q_tmp[0], (float32_t *)&FPGA_Audio_Buffer_RX1_Q_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
		}
	}
	else if(rx_id==AUDIO_RX2)
	{
		if (SecondaryVFO()->HPF_Filter_Width > 0)
		{
			arm_iir_lattice_f32(&IIR_RX2_HPF_I, (float32_t *)&FPGA_Audio_Buffer_RX2_I_tmp[0], (float32_t *)&FPGA_Audio_Buffer_RX2_I_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
			arm_iir_lattice_f32(&IIR_RX2_HPF_Q, (float32_t *)&FPGA_Audio_Buffer_RX2_Q_tmp[0], (float32_t *)&FPGA_Audio_Buffer_RX2_Q_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
		}
	}
}

static void doRX_NOTCH(AUDIO_PROC_RX_NUM rx_id)
{
	//NOTCH FILTER
	if(rx_id==AUDIO_RX1)
	{
		if (CurrentVFO()->NotchFilter)
			arm_biquad_cascade_df2T_f32(&NOTCH_RX1_FILTER, (float32_t *)&FPGA_Audio_Buffer_RX1_I_tmp[0], (float32_t *)&FPGA_Audio_Buffer_RX1_I_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
	}
	else if(rx_id==AUDIO_RX2)
	{
		if (SecondaryVFO()->NotchFilter)
			arm_biquad_cascade_df2T_f32(&NOTCH_RX2_FILTER, (float32_t *)&FPGA_Audio_Buffer_RX2_I_tmp[0], (float32_t *)&FPGA_Audio_Buffer_RX2_I_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
	}
}

static void doRX_DNR(AUDIO_PROC_RX_NUM rx_id)
{
	//Digital Noise Reduction
	if(rx_id==AUDIO_RX1)
	{
		if (CurrentVFO()->DNR > 0)
		{
			for (block = 0; block < (FPGA_AUDIO_BUFFER_HALF_SIZE / NOISE_REDUCTION_BLOCK_SIZE); block++)
				processNoiseReduction((float32_t *)&FPGA_Audio_Buffer_RX1_I_tmp[0] + (block * NOISE_REDUCTION_BLOCK_SIZE), (float32_t *)&FPGA_Audio_Buffer_RX1_I_tmp[0] + (block * NOISE_REDUCTION_BLOCK_SIZE), rx_id);
		}
	}
	else if(rx_id==AUDIO_RX2)
	{
		if (SecondaryVFO()->DNR > 0)
		{
			for (block = 0; block < (FPGA_AUDIO_BUFFER_HALF_SIZE / NOISE_REDUCTION_BLOCK_SIZE); block++)
				processNoiseReduction((float32_t *)&FPGA_Audio_Buffer_RX2_I_tmp[0] + (block * NOISE_REDUCTION_BLOCK_SIZE), (float32_t *)&FPGA_Audio_Buffer_RX2_I_tmp[0] + (block * NOISE_REDUCTION_BLOCK_SIZE), rx_id);
		}
	}
}

static void doRX_AGC(AUDIO_PROC_RX_NUM rx_id)
{
	//AGC
	if(rx_id==AUDIO_RX1)
		DoAGC((float32_t *)&FPGA_Audio_Buffer_RX1_I_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE, rx_id);
	else if(rx_id==AUDIO_RX2)
		DoAGC((float32_t *)&FPGA_Audio_Buffer_RX2_I_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE, rx_id);
}

static void doRX_SMETER(AUDIO_PROC_RX_NUM rx_id)
{
	//Prepare data to calculate s-meter
	float32_t i = 0;
	if(rx_id==AUDIO_RX1)
		arm_power_f32(FPGA_Audio_Buffer_RX1_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE, &i);
	else if(rx_id==AUDIO_RX2)
		arm_power_f32(FPGA_Audio_Buffer_RX2_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE, &i);
	Processor_RX_Power_value = i / (float32_t)FPGA_AUDIO_BUFFER_HALF_SIZE;
}

static void doRX_COPYCHANNEL(AUDIO_PROC_RX_NUM rx_id)
{
	//Double channel I->Q
	if(rx_id==AUDIO_RX1)
		dma_memcpy32((uint32_t)&FPGA_Audio_Buffer_RX1_Q_tmp[0], (uint32_t)&FPGA_Audio_Buffer_RX1_I_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
	else if(rx_id==AUDIO_RX2)
		dma_memcpy32((uint32_t)&FPGA_Audio_Buffer_RX2_Q_tmp[0], (uint32_t)&FPGA_Audio_Buffer_RX2_I_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
}

static float32_t DFM_RX1_lpf_prev = 0, DFM_RX1_hpf_prev_a = 0, DFM_RX1_hpf_prev_b = 0, DFM_RX2_lpf_prev = 0, DFM_RX2_hpf_prev_a = 0, DFM_RX2_hpf_prev_b = 0; // used in FM detection and low/high pass processing
static float32_t DFM_RX1_i_prev = 0, DFM_RX1_q_prev = 0, DFM_RX2_i_prev = 0, DFM_RX2_q_prev = 0; // used in FM detection and low/high pass processing
static uint_fast8_t DFM_RX1_fm_sql_count = 0, DFM_RX2_fm_sql_count = 0; // used for squelch processing and debouncing tone detection, respectively
float32_t DFM_RX1_fm_sql_avg = 0.0f;
float32_t DFM_RX2_fm_sql_avg = 0.0f;

static void DemodulateFM(AUDIO_PROC_RX_NUM rx_id)
{
	float32_t angle, x, y, a, b;
	float32_t squelch_buf[FPGA_AUDIO_BUFFER_HALF_SIZE];
	
	float32_t* lpf_prev;
	float32_t* hpf_prev_a;
	float32_t* hpf_prev_b;
	float32_t* i_prev;
	float32_t* q_prev;
	uint_fast8_t* fm_sql_count;
	float32_t* FPGA_Audio_Buffer_I_tmp;
	float32_t* FPGA_Audio_Buffer_Q_tmp;
	float32_t* fm_sql_avg;
	if(rx_id==AUDIO_RX1)
	{
		lpf_prev = &DFM_RX1_lpf_prev;
		hpf_prev_a = &DFM_RX1_hpf_prev_a;
		hpf_prev_b = &DFM_RX1_hpf_prev_b;
		i_prev = &DFM_RX1_i_prev;
		q_prev = &DFM_RX1_q_prev;
		fm_sql_count = &DFM_RX1_fm_sql_count;
		fm_sql_avg = &DFM_RX1_fm_sql_avg;
		FPGA_Audio_Buffer_I_tmp = &FPGA_Audio_Buffer_RX1_I_tmp[0];
		FPGA_Audio_Buffer_Q_tmp = &FPGA_Audio_Buffer_RX1_Q_tmp[0];
	}
	else if(rx_id==AUDIO_RX2)
	{
		lpf_prev = &DFM_RX2_lpf_prev;
		hpf_prev_a = &DFM_RX2_hpf_prev_a;
		hpf_prev_b = &DFM_RX2_hpf_prev_b;
		i_prev = &DFM_RX2_i_prev;
		q_prev = &DFM_RX2_q_prev;
		fm_sql_count = &DFM_RX2_fm_sql_count;
		fm_sql_avg = &DFM_RX2_fm_sql_avg;
		FPGA_Audio_Buffer_I_tmp = &FPGA_Audio_Buffer_RX2_I_tmp[0];
		FPGA_Audio_Buffer_Q_tmp = &FPGA_Audio_Buffer_RX2_Q_tmp[0];
	}
	
	for (uint_fast16_t i = 0; i < FPGA_AUDIO_BUFFER_HALF_SIZE; i++)
	{
		// first, calculate "x" and "y" for the arctan2, comparing the vectors of present data with previous data
		y = (FPGA_Audio_Buffer_Q_tmp[i] * *i_prev) - (FPGA_Audio_Buffer_I_tmp[i] * *q_prev);
		x = (FPGA_Audio_Buffer_I_tmp[i] * *i_prev) + (FPGA_Audio_Buffer_Q_tmp[i] * *q_prev);
		angle = atan2f(y, x);

