witalis3/UA3REO-DDC-Transceiver/STM32/Src/audio_processor.c
		// we now have our audio in "angle"
		squelch_buf[i] = angle; // save audio in "d" buffer for squelch noise filtering/detection - done later

		a = *lpf_prev + (FM_RX_LPF_ALPHA * (angle - *lpf_prev)); //
		*lpf_prev = a;										   // save "[n-1]" sample for next iteration

		*q_prev = FPGA_Audio_Buffer_Q_tmp[i]; // save "previous" value of each channel to allow detection of the change of angle in next go-around
		*i_prev = FPGA_Audio_Buffer_I_tmp[i];

		if ((!TRX_Squelched) || (!TRX.FM_SQL_threshold)) // high-pass audio only if we are un-squelched (to save processor time)
		{
			if (TRX_getMode(CurrentVFO()) == TRX_MODE_WFM)
			{
				FPGA_Audio_Buffer_I_tmp[i] = (float32_t)(angle / PI * (1 << 14)); //second way
			}
			else
			{
				b = FM_RX_HPF_ALPHA * (*hpf_prev_b + a - *hpf_prev_a); // do differentiation
				*hpf_prev_a = a;										 // save "[n-1]" samples for next iteration
				*hpf_prev_b = b;
				FPGA_Audio_Buffer_I_tmp[i] = b * 30000.0f; // save demodulated and filtered audio in main audio processing buffer
			}
		}
		else if (TRX_Squelched)				// were we squelched or tone NOT detected?
			FPGA_Audio_Buffer_I_tmp[i] = 0; // do not filter receive audio - fill buffer with zeroes to mute it
	}

	// *** Squelch Processing ***
	//arm_iir_lattice_f32(&IIR_Squelch_HPF, squelch_buf, squelch_buf, FPGA_AUDIO_BUFFER_HALF_SIZE);	// Do IIR high-pass filter on audio so we may detect squelch noise energy
	*fm_sql_avg = ((1.0f - FM_RX_SQL_SMOOTHING) * *fm_sql_avg) + (FM_RX_SQL_SMOOTHING * sqrtf(fabsf(squelch_buf[0]))); // IIR filter squelch energy magnitude:  We need look at only one representative sample

	// Squelch processing
	// Determine if the (averaged) energy in "ads.fm_sql_avg" is above or below the squelch threshold
	if (*fm_sql_count == 0) // do the squelch threshold calculation much less often than we are called to process this audio
	{
		if (*fm_sql_avg > 0.7f) // limit maximum noise value in averaging to keep it from going out into the weeds under no-signal conditions (higher = noisier)
			*fm_sql_avg = 0.7f;
		b = *fm_sql_avg * 10.0f; // scale noise amplitude to range of squelch setting
		// Now evaluate noise power with respect to squelch setting
		if (!TRX.FM_SQL_threshold) // is squelch set to zero?
			TRX_Squelched = false; // yes, the we are un-squelched
		else if (TRX_Squelched)	// are we squelched?
		{
			if (b <= (float)((10 - TRX.FM_SQL_threshold) - FM_SQUELCH_HYSTERESIS)) // yes - is average above threshold plus hysteresis?
				TRX_Squelched = false;											   //  yes, open the squelch
		}
		else // is the squelch open (e.g. passing audio)?
		{
			if ((10.0f - TRX.FM_SQL_threshold) > FM_SQUELCH_HYSTERESIS) // is setting higher than hysteresis?
			{
				if (b > (float)((10 - TRX.FM_SQL_threshold) + FM_SQUELCH_HYSTERESIS)) // yes - is average below threshold minus hysteresis?
					TRX_Squelched = true;											  // yes, close the squelch
			}
			else // setting is lower than hysteresis so we can't use it!
			{
				if (b > (10.0f - (float)TRX.FM_SQL_threshold)) // yes - is average below threshold?
					TRX_Squelched = true;					   // yes, close the squelch
			}
		}
		//
		(*fm_sql_count)++; // bump count that controls how often the squelch threshold is checked
		if (*fm_sql_count >= FM_SQUELCH_PROC_DECIMATION)
			*fm_sql_count = 0; // enforce the count limit
	}
}

static void ModulateFM(void)
{
	static uint32_t modulation = TRX_SAMPLERATE;
	static float32_t hpf_prev_a = 0;
	static float32_t hpf_prev_b = 0;
	static float32_t sin_data = 0;
	static uint32_t fm_mod_accum = 0;
	static float32_t modulation_index = 2.0f;
	if (CurrentVFO()->LPF_Filter_Width == 5000)
		modulation_index = 2.0f;
	if (CurrentVFO()->LPF_Filter_Width == 6000)
		modulation_index = 3.0f;
	if (CurrentVFO()->LPF_Filter_Width == 7000)
		modulation_index = 4.0f;
	if (CurrentVFO()->LPF_Filter_Width == 8000)
		modulation_index = 5.0f;
	if (CurrentVFO()->LPF_Filter_Width == 9000)
		modulation_index = 6.0f;
	if (CurrentVFO()->LPF_Filter_Width == 10000)
		modulation_index = 7.0f;
	if (CurrentVFO()->LPF_Filter_Width == 15000)
		modulation_index = 8.0f;
	if (CurrentVFO()->LPF_Filter_Width == 20000)
		modulation_index = 9.0f;
	if (CurrentVFO()->LPF_Filter_Width == 0)
		modulation_index = 10.0f;
	// Do differentiating high-pass filter to provide 6dB/octave pre-emphasis - which also removes any DC component!
	for (uint_fast16_t i = 0; i < FPGA_AUDIO_BUFFER_HALF_SIZE; i++)
	{
		float32_t a = FPGA_Audio_Buffer_TX_I_tmp[i];
		hpf_prev_b = FM_TX_HPF_ALPHA * (hpf_prev_b + a - hpf_prev_a); // do differentiation
		hpf_prev_a = a;												  // save "[n-1] samples for next iteration
		fm_mod_accum += hpf_prev_b;									  // save differentiated data in audio buffer // change frequency using scaled audio
		fm_mod_accum %= modulation;									  // limit range
		sin_data = (fm_mod_accum / (float32_t)modulation) * PI * modulation_index;
		FPGA_Audio_Buffer_TX_I_tmp[i] = Processor_selected_RFpower_amplitude * arm_sin_f32(sin_data);
		FPGA_Audio_Buffer_TX_Q_tmp[i] = Processor_selected_RFpower_amplitude * arm_cos_f32(sin_data);
	}
}
